/*---------- 動物の固定マーカー ----------*/
let markerData = [
  {
    title: "とくしま動物園へようこそ！",
    pos: {lat: 34.0139, lng: 134.52075},
    img: "./pic/gate.JPG",
    num: 0
  },{
    title: "①フライングゲージ",
    pos: {lat: 34.01531, lng: 134.52141},
    img: "./pic/fly1.JPG",
    num: 1
  },{
    title: "②ニホンカモシカ",
    pos: {lat: 34.01442, lng: 134.52155},
    img: "./pic/kamoshika.JPG",
    num: 2
  },{
    title: "③温帯プロムナード",
    pos: {lat: 34.01435, lng: 134.52192},
    img: "./pic/lesserpanda1.JPG",
    num: 3
  },{
    title: "④ツキノワグマ",
    pos: {lat: 34.01405, lng: 134.5218},
    img: "./pic/tsukinowaguma0.JPG",
    num: 4
  },{
    title: "⑤モンキープロムナード",
    pos: {lat: 34.01395, lng: 134.522133},
    img: "./pic/shishiozaru1.JPG",
    num: 5
  },{
    title: "⑥タイガープロムナード",
    pos: {lat: 34.01435, lng: 134.5226},
    img: "./pic/tora1.JPG",
    num: 6
  },{
    title: "⑦セイロンゾウ",
    pos: {lat: 34.01465, lng: 134.52288},
    img: "./pic/zou2.JPG",
    num: 7
  },{
    title: "⑧ミーアキャット",
    pos: {lat: 34.0153, lng: 134.52306},
    img: "./pic/miacat.JPG",
    num: 8
  },{
    title: "⑨ライオン",
    pos: {lat: 34.01532, lng: 134.52284},
    img: "./pic/lion.JPG",
    num: 9
  },{
    title: "⑩サバンナ区",
    pos: {lat: 34.0157, lng: 134.52256},
    img: "./pic/sabanna3.JPG",
    num: 10
  },{
    title: "⑪フラミンゴ",
    pos: {lat: 34.01487, lng: 134.52250},
    img: "./pic/flamingo1.JPG",
    num: 11
  },{
    title: "⑫オオカミ",
    pos: {lat: 34.01482, lng: 134.520447},
    img: "./pic/ookami1.JPG",
    num: 12
  },{
    title: "⑬ホッキョクグマ",
    pos: {lat: 34.01452, lng: 134.52031},
    img: "./pic/pololo4.JPG",
    num: 13
  },{
    title: "⑮アンデスコンドル",
    pos: {lat: 34.014425, lng: 134.51969},
    img: "./pic/condol.JPG",
    num: 14
  },{
    title: "⑯こども動物園",
    pos: {lat: 34.01425, lng: 134.51915},
    img: "./pic/pengin.JPG",
    num: 15
  }
];


/*---------- チェックポイントの目安円 ----------*/
//サバンナ区がチェックポイント２つのため、
//markerDataとの番号合わせに片方をcheckCircle[0]とする
let checkCircle = [
  { lat: 34.01541, lng: 134.52263,  //サバンナ１
    r: 15
  },{
    lat: 34.01529, lng: 134.52138,  //とり
    r: 33
  },{
    lat: 34.01444, lng: 134.52157,  //カモシカ
    r: 13
  },{
    lat: 34.01436, lng: 134.52193,  //温帯
    r: 21
  },{
    lat: 34.01404, lng: 134.52183,  //くま
    r: 15
  },{
    lat: 34.01394, lng: 134.52219, //さる
    r: 19.5
  },{
    lat: 34.01423, lng: 134.52255,  //とら
    r: 26
  },{
    lat: 34.01467, lng: 134.52293,  //ゾウ
    r: 32.5
  },{
    lat: 34.01527, lng: 134.52308,  //ミーア
    r: 11
  },{
    lat: 34.01524, lng: 134.52284,  //ライオン
    r: 11
  },{
    lat: 34.01518, lng: 134.52230,  //サバンナ２
    r: 15
  },{
    lat: 34.01487, lng: 134.52246,  //フラミンゴ
    r: 16
  },{
    lat: 34.01480, lng: 134.52047,  //オオカミ
    r: 13
  },{
    lat: 34.01455, lng: 134.52031,  //ホッキョクグマ
    r: 17
  },{
    lat: 34.01436, lng: 134.51973,  //コンドル
    r: 14
  },{
    lat: 34.01430, lng: 134.51911,  //こども動物園
    r: 40
  },{
    lat: 34.01385, lng: 134.51930,  //出口
    r: 12
  }
];


/*---------- ベンチマーカー ----------*/
let benchData = [
  {
    pos: {lat: 34.01421, lng: 134.52070},   //入口(休憩所)
    num:1
  },{
    pos: {lat: 34.01455, lng: 134.52132},   //展示場前
    num:2
  },{
    pos: {lat: 34.01492, lng: 134.52098},   //鳥の前
    num:3
  },
  
  {
    pos:{lat: 34.015125, lng: 134.521675},   //鳥のとこ
    num:4
  },{
    pos:{lat: 34.014355, lng: 134.52159},   //カモシカ
    num:5
  },{
    pos:{lat: 34.01403, lng: 134.52195},   //ツキノワグマのとこ
    num:6
  },{
    pos:{lat: 34.01412, lng: 134.522345},   //トラの前
    num:7
  },{
    pos:{lat: 34.014425, lng: 134.52288},   //ゾウの東
    num:8
  },{
    pos:{lat: 34.014785, lng: 134.52268},   //ゾウの西
    num:9
  },{
    pos:{lat: 34.01522, lng: 134.52285},   //ライオンの前
    num:10
  },{
    pos:{lat: 34.01519, lng: 134.52262},   //サバンナの手前
    num:11
  },{
    pos:{lat: 34.01448, lng: 134.52228},   //ピクニック広場
    num:12
  },{
    pos:{lat: 34.01521, lng: 134.52226},   //カピバラのとこ
    num:13
  },{
    pos:{lat: 34.01514, lng: 134.52213},   //レストラン
    num:14
  },{
    pos: {lat: 34.01485, lng: 134.52201},   //レストラン南
    num:15
  },{
    pos:{lat: 34.01484, lng: 134.52089},   //トンネル
    num:16
  },{
    pos:{lat: 34.01479, lng: 134.52039},   //オオカミのとこ
    num:17
  },{
    pos:{lat: 34.01448, lng: 134.52041},   //ホッキョクグマの手前
    num:18
  },{
    pos:{lat: 34.014425, lng: 134.52033},   //ホッキョクグマのパラソルあるとこ
    num:19
  },{
    pos:{lat: 34.01432, lng: 134.51971},   //コンドルのとこ
    num:20
  },{
    pos:{lat: 34.01438, lng: 134.51928},   //こども動物園のパラソルのとこ
    num:21
  },{
    pos:{lat: 34.014395, lng: 134.51886},   //ウサギの横
    num:22
  }
];


let toiletData = [
  {
    pos: {lat: 34.013957, lng: 134.52068},   //入口(中)
    num:1
  },{
    pos: {lat: 34.013947, lng: 134.52058},   //入口(外)
    num:2
  },{
    pos: {lat: 34.01459, lng: 134.52096},   //展示場
    num:3
  },{
    pos: {lat: 34.01505, lng: 134.52194},   //レストランよこ
    num:4
  },{
    pos: {lat: 34.01422, lng: 134.51935},   //こども動物園よこ
    num:5
  }
];
